snlkuharlocal/src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКредита</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>EnumRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежа</name>
    <type>
      <types>CatalogRef.ОтсрочкиПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЦБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБух</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПроцентовПоКредиту</name>
    <type>
      <types>EnumRef.СпособыРасчетаПроцентовПоКредиту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПоКредиту</name>
    <comment>Процент по кредиту (Периодический реквизит)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора_Новый</name>
    <type>
      <types>CatalogRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСоглашение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассовыйДоговорТЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>CatalogRef.КодыПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиСБ</name>
    <comment>Процент скидки для сезонного бонусуа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИспользованияДоговоров</name>
    <comment>0 - указыввается вручную, 1 - расчеты по счетам, 2 - используется основной договор</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляОплаты</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьМатрицу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСкановДоговоров</name>
    <type>
      <types>EnumRef.СостоянияСкановДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАрхивнойКоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПроверкиСБ</name>
    <type>
      <types>CatalogRef.РезультатыПроверкиСБ</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованоБухгалтерией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическоеПлечо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеФайлы</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ДополнительныеФайлыДоговора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Enums/УсловияОплаты/УсловияОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияОплаты</name>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Отсрочка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДоговоров</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Бонус</name>
      <description>Бонус</description>
    </items>
    <items>
      <name>Возвраты</name>
      <description>Возвраты</description>
    </items>
    <items>
      <name>ДеньгиВПути</name>
      <description>Деньги в пути</description>
    </items>
    <items>
      <name>Конвертация</name>
      <description>Конвертация</description>
    </items>
    <items>
      <name>ПроцентыПоКредиту</name>
      <description>Проценты по кредиту</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>СезонныйБонус</name>
      <description>Сезонный бонус</description>
    </items>
    <items>
      <name>Товары_Закупка</name>
      <description>Товары (закупка)</description>
    </items>
    <items>
      <name>Товары_Продажа</name>
      <description>Товары (продажа)</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
  </predefined>
  <attributes>
    <name>СтатьяЗатратКР</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/Договоры/ManagerModule.bsl
Функция ЭтоДоговорПродажиСПредоплатой(ДоговорСсылка) Экспорт
	Результат = Ложь;
	Если ТипЗнч(ДоговорСсылка) = Тип("СправочникСсылка.Договоры") И ЗначениеЗаполнено(ДоговорСсылка) Тогда
		рШапки = ПолучитьРеквизитыШапки(ДоговорСсылка, "ВидДоговора_Новый,УсловияОплаты");
		Если рШапки.ВидДоговора_Новый = Справочники.ВидыДоговоров.Товары_Продажа
			И рШапки.УсловияОплаты = Перечисления.УсловияОплаты.Предоплата Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции //ЭтоДоговорПродажиСПредоплатой(Ссылка) Экспорт

Функция НайтиСоздатьДоговорВозврата(ДоговорОтгрузки) Экспорт
	Результат = Справочники.Договоры.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ДоговорОтгрузки) Тогда
		пПоиска = Новый Структура("Владелец,Организация,ВалютаКредита,ВидДоговора_Новый", 
		ДоговорОтгрузки.Владелец, ДоговорОтгрузки.Организация, ДоговорОтгрузки.ВалютаКредита, Справочники.ВидыДоговоров.Возвраты
		);
		
		Результат = МаркировкаС.НайтиСправочник("Договоры", пПоиска); 
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Дог_Объект = Справочники.Договоры.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(Дог_Объект, пПоиска);	
			Дог_Объект.Наименование = "Возвраты";
			
			Дог_Объект.КодЦБ		= ДоговорОтгрузки.КодЦБ;
			Дог_Объект.КодБух		= ДоговорОтгрузки.КодБух;
			
			УстановитьПривилегированныйРежим(Истина);
			Дог_Объект.Записать();
			
			Результат = Дог_Объект.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НайтиСоздатьДоговорВозврата(ДоговорОтгрузки) Экспорт
